{    
    "profile_address" : "Via Silvio Pellico, 10073 Ciriè (TO), Piemonte, Italia",
    "profile_driving" : "Patente B",
    "about_me_title" : "Su di me",
    "about_me_text" : [
        "Sin da piccolo ho avuto la passione per l'informatica e in generale per i computer. Mi piace passare il mio tempo libero ammirando opere di animazione e computer grafica, ma anche vivere in prima persona avventure in cui altre persone hanno messo l'anima. Sono anche appassionato di strategia, il che mi ha portato a farmi una vetrinetta di giochi da tavolo impegnativi ma anche goliardici.",
        "Mi sono sempre visto come un buon connubio di razionalità e sentimentalismo, combinazione che mi ha portato ad apprezzare molto la psicologia approfondendo con diverse letture. Grazie alla psicologia e alle mie esperienze nei lavori di gruppo, ho capito quanto sia fondamentale una buona comunicazione e un buon rapporto con tutti i colleghi/clienti.\nUno degli obiettivi della mia vita è infatti riuscire a realizzare qualcosa, che sia un videogioco o un cortometraggio, in grado di emozionare e trasportare profondi insegnamenti.", 
        "Il mio amore per la scienza e l'informatica mi hanno portato a conseguire una laurea Triennale al Politecnico di Torino in ingegneria informatica, e la passione per i videogiochi mi ha fatto intraprendere il ramo di Grafica e Multimedia, con qualche pizzico di sicurezza informatica, un altro campo che mi ha sempre appassionato. Adesso sono quasi alla fine di questo intenso cammino che sono orgoglioso di aver scelto perché mi ha permesso di crescere ed aprire la mente."
    ],
    "interest_title" : "I miei interessi",
    "interests" : ["Videogiochi", "Letteratura", "Psicologia", "Realtà Virtuale", "Elaboratori", "Medicina", "Giochi da tavolo", "Sport"],
    "skills" : [
        {"name" : "GRAFICA", "list" : "Unity | Blender | OpenGL"},
        {"name" : "LINGUAGGI DI PROGRAMMAZIONE", "list" : "Assembly | C | C++ | C# | Java | Javascript | Html | Python"},
        {"name" : "ANALISI E VISUALIZZAZIONE DATI", "list" : "Database management (DBMS) | SQL | MATLAB"},
        {"name" : "SISTEMI OPERATIVI", "list" : "Windows | Linux | Unix based systems"},
        {"name" : "CRITTOGRAFIA E SICUREZZA INFORMATICA", "list" : "Python | C"},
        {"name" : "ELABORAZIONE FOTO E VIDEO/COMPUTER VISION", "list" : "Photoshop | DaVinci | GIMP | Python"},
        {"name" : "ARCHITETTURE DI RETE", "list" : "Wireshark | Ettercap"} ,
        {"name" : "INTERNET VIDEO STREAMING", "list" : "Audio codecs | Video codecs | Multimedia apps over internet"} 
    ]    
}



